Tekla.Structures.Model.ControlPolycurve
The ControlPolycurve class defines a user defined polycurve object which contains a chain of line and arc geometries.

Tekla.Structures.Model.ControlPolycurve.MinimumCurveNumber
Minimum number of curves in the polycurve to be inserted/modified

Tekla.Structures.Model.ControlPolycurve.geometry
The internal polycurve geometry

Tekla.Structures.Model.ControlPolycurve.insufficientNumberOfGeometries
Message to be sent along the exception thrown when the number of geometries is too low

Tekla.Structures.Model.ControlPolycurve.Color
Gets or sets color of the Polycurve.

Tekla.Structures.Model.ControlPolycurve.LineType
Gets or sets the line type of the polycurve.

Tekla.Structures.Model.ControlPolycurve.Geometry
Gets or sets geometry list that defines geometry of the polycurve.

Tekla.Structures.Model.ControlPolycurve.#ctor
Initializes a new instance of the Tekla.Structures.Model.ControlPolycurve class.
The default values are as follows:
Color = ControlObjectColorEnum.BLUE;
LineType = LineType.DashDot;

Tekla.Structures.Model.ControlPolycurve.#ctor(Tekla.Structures.Geometry3d.Polycurve)
Initializes a new instance of the Tekla.Structures.Model.ControlPolycurve class.
geometry: Geometry of the control polycurve.

Tekla.Structures.Model.ControlPolycurve.Delete
Deletes a polycurve with given Identifier.
Returns: True on success, false otherwise.

Tekla.Structures.Model.ControlPolycurve.Insert
Inserts a polycurve into the model.
Returns: True on success, false otherwise.

Tekla.Structures.Model.ControlPolycurve.Modify
Modifies a polycurve with the given Identifier.
Returns: True on success, false otherwise.

Tekla.Structures.Model.ControlPolycurve.Select
Selects a polycurve with the given Identifier.
Returns: True on success, false otherwise.

Tekla.Structures.Model.ControlPolycurve.ToStruct(Tekla.Structures.ModelInternal.dotControlObject_t@)
Method for object conversion from dotNet to core.
PlaneStruct: Struct containing the polycurve properties

Tekla.Structures.Model.ControlPolycurve.FromStruct(Tekla.Structures.ModelInternal.dotControlObject_t@)
Method for object conversion from core to dotNet.
PlaneStruct: Struct containing the polycurve properties

Tekla.Structures.Model.ControlPolycurve.CreateInstance
Method for creation of the object.
Returns: True on success, false otherwise.

Tekla.Structures.Model.ControlPolycurve.SelectInstance
Method for selection of the object.
Returns: True on success, false otherwise.

Tekla.Structures.Model.ControlPolycurve.ModifyInstance
Method for modifying the object.
Returns: True on success, false otherwise.